src/DataProcessors/СверкаОстатковМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>СверкаОстатковМДЛП</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ДанныеПотребительскихУпаковок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерУпаковки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>gtin</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЕСКЛП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусМДЛП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:EnumRef.СтатусыУпаковокМДЛП</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыУпаковокМДЛП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСтатусаМДЛП</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСтатуса</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходныйСтатус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыУпаковокМДЛП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРезерваМДЛП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>18</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРезерва</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>18</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрупповаяУпаковка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерГрупповойУпаковкиМДЛП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерГрупповойУпаковки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзмененаИнформацияОбУпаковках</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеТовара</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикиИспользуются</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСерии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГоденДо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзмененыДанныеНоменклатуры</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникФинансированияМДЛП</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИсточникиФинансированияМДЛП</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВладелецМДЛП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОрганизацииМДЛП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЭмиссииМДЛП</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыЭмиссииУпаковокМДЛП</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьИнформацияВМДЛП</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьИнформацияВБазе</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеТранспортныхУпаковок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерУпаковки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусМДЛП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:EnumRef.СтатусыУпаковокМДЛП</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыУпаковокМДЛП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСтатусаМДЛП</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСтатуса</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходныйСтатус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыУпаковокМДЛП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРезерваМДЛП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>18</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРезерва</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>18</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрупповаяУпаковка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерГрупповойУпаковкиМДЛП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерГрупповойУпаковки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВложеныПотребительскиеУпаковкиМДЛП</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВложеныПотребительскиеУпаковки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзмененаИнформацияОбУпаковках</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВладелецМДЛП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОрганизацииМДЛП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЭмиссииМДЛП</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыЭмиссииУпаковокМДЛП</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьИнформацияВМДЛП</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьИнформацияВБазе</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиИерархии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Enums/СтатусыУпаковокМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыУпаковокМДЛП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВОбороте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРезерве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбылаИзОборота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетВыпуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданаНаУничтожение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданаНаУничтожениеВРезерве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КПоступлению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВУпаковке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгруженВРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВвезенНаТерриториюРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задекларирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/СверкаОстатковМДЛП/Forms/СверкаОстатков/Ext/Form/Module.bsl
&НаКлиенте
Перем ПараметрыПодключения;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ИнтеграцияМДЛППереопределяемый.НастроитьПодключаемоеОборудование(ЭтотОбъект);
	
	Организация       = Параметры.Организация;
	МестоДеятельности = Параметры.МестоДеятельности;
	УстановитьИдентификаторМестаДеятельности();
	
	ПравоИзмененияУпаковокМДЛП = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.УпаковкиМДЛП);
	Элементы.ЗаполнитьУпаковкиПоДаннымМДЛП.Видимость = ПравоИзмененияУпаковокМДЛП;
	Элементы.ЗаписатьИзмененияУпаковок.Видимость     = ПравоИзмененияУпаковокМДЛП;
	
	ИспользоватьСерии = ИнтеграцияМДЛП.ИспользоватьСерииНоменклатуры();
	Элементы.ДанныеПотребительскихУпаковокСерия.Видимость = ИспользоватьСерии;
	Элементы.СгенерироватьСерии.Видимость                 = ИспользоватьСерии;
	
	Элементы.ДанныеПотребительскихУпаковокХарактеристика.Видимость = ИнтеграцияМДЛП.ИспользоватьХарактеристикиНоменклатуры();
	Элементы.ДанныеПотребительскихУпаковокУпаковка.Видимость       = ИнтеграцияМДЛП.ИспользоватьУпаковкиНоменклатуры();
	
	ПараметрыУказанияСерий = ГосударственныеИнформационныеСистемыПереопределяемый.ПараметрыУказанияСерийФормыОбъекта(ЭтотОбъект, Обработки.СверкаОстатковМДЛП);
	
	РазмерПорции = 20;
	ТекущийНомерПорции = 1;
	
	СоздатьЭлементыДинамическихОтборов();
	
	УстановитьОтображениеКнопок();
	
	СобытияФормМДЛППереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Настройки.Удалить("Организация");
		Настройки.Удалить("МестоДеятельности");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(МестоДеятельности) Тогда
		УстановитьОтображениеКнопок(Элементы.ПолучитьУпаковкиМДЛП.Имя);
	КонецЕсли;
	
	УстановитьИдентификаторМестаДеятельности();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование.СканерыШтрихкода
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ПодключаемоеОборудование.СканерыШтрихкода") Тогда
		ПоддерживаемыеТипыПодключаемогоОборудования = "СканерШтрихкода";
		МодульМенеджерОборудованияКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("МенеджерОборудованияКлиент");
		МодульМенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, ПоддерживаемыеТипыПодключаемогоОборудования);
	КонецЕсли;
	// Конец ПодключаемоеОборудование.СканерыШтрихкода
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() И Не ТолькоПросмотр Тогда
		Если ИмяСобытия = "ScanData" Тогда
			ДанныеШтрихкода = ИнтеграцияМДЛПКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр);
			ОбработатьШтрихкоды(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеШтрихкода));
		КонецЕсли;
	КонецЕсли;
	
	СобытияФормМДЛПКлиентПереопределяемый.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповестить = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
	ТекстСообщения = НСтр("ru = 'Данные были изменены. Записать изменения?'");
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповестить, Отказ, ЗавершениеРаботы, ТекстСообщения, ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ПодключаемоеОборудование") Тогда
		МодульМенеджерОборудованияКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("МенеджерОборудованияКлиент");
		МодульМенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьУпаковкиМДЛП(Команда)
	
	ОчиститьСообщения();
	
	ТекущийНомерПорции = 1;
	
	НачатьПолучениеУпаковокМДЛП();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУпаковкиПоДаннымМДЛП(Команда)
	
	Результат = ЗаполнитьУпаковкиПоДаннымМДЛПНаСервере();
	ОповеститьОбОкончанииЗаполненияУпаковок(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзТСД(Команда)
	
	ОчиститьСообщения();
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ПодключаемоеОборудование.ТерминалыСбораДанных") Тогда
		МодульМенеджерОборудованияКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("МенеджерОборудованияКлиент");
		МодульМенеджерОборудованияКлиент.НачатьЗагрузкуДанныеИзТСД(
			Новый ОписаниеОповещения("ЗагрузитьИзТСДЗавершение", ЭтотОбъект),
			УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьСерии(Команда)
	
	Результат = СгенерироватьСерииНаСервере();
	СобытияФормМДЛПКлиент.ОповеститьОбОкончанииЗаполненияСерийВДокументе(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзмененияУпаковок(Команда)
	
	ЗаписатьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормМДЛПКлиентПереопределяемый.ВыполнитьПереопределяемуюКоманду(ЭтотОбъект, Команда);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура МестоДеятельностиПриИзменении(Элемент)
	
	МестоДеятельностиПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УстановитьОтображениеКнопок(Элементы.ПолучитьУпаковкиМДЛП.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПотребительскихУпаковокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Не ЗапрещенВводДанныхНоменклатуры
	   И (Поле = Элементы.ДанныеПотребительскихУпаковокНоменклатура
		Или Поле = Элементы.ДанныеПотребительскихУпаковокХарактеристика
		Или Поле = Элементы.ДанныеПотребительскихУпаковокСерия
		Или Поле = Элементы.ДанныеПотребительскихУпаковокУпаковка
		Или Поле = Элементы.ДанныеПотребительскихУпаковокЕдиницаИзмерения) Тогда
		
		ТекущиеДанные = Объект.ДанныеПотребительскихУпаковок.НайтиПоИдентификатору(ВыбраннаяСтрока);
		ПараметрыФормы = Новый Структура("Номенклатура, Характеристика, Серия, Упаковка, ЕдиницаИзмерения");
		ЗаполнитьЗначенияСвойств(ПараметрыФормы, ТекущиеДанные);
		
		Оповестить = Новый ОписаниеОповещения("ОбработатьВводДанныхНоменклатуры", ЭтотОбъект, ВыбраннаяСтрока);
		ОткрытьФорму("Обработка.СверкаОстатковМДЛП.Форма.ФормаВводаДанныхНоменклатуры", ПараметрыФормы, ЭтотОбъект,,,, Оповестить);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазмерПорцииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если РазмерПорции = ВыбранноеЗначение Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	РазмерПорции = ВыбранноеЗначение;
	ТекущийНомерПорции = 1;
	
	НачатьПолучениеУпаковокМДЛП();
	
КонецПроцедуры

&НаКлиенте
Процедура НомераПорцийОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НовыйНомерПорции = Число(НавигационнаяСсылкаФорматированнойСтроки);
	Если ТекущийНомерПорции = НовыйНомерПорции Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	ТекущийНомерПорции = НовыйНомерПорции;
	
	НачатьПолучениеУпаковокМДЛП();
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовФормы

#Область СлужебныеПроцедурыИФункции

#Область Отборы

&НаСервере
Процедура СоздатьЭлементыДинамическихОтборов()
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеЭлементы = Новый Массив;
	
	ПараметрыОтборов = ПараметрыОтборовУпаковокМДЛП();
	Для Каждого КлючИЗначение Из ПараметрыОтборов Цикл
		
		ПараметрыОтбора = КлючИЗначение.Значение;
		
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(КлючИЗначение.Ключ, ПараметрыОтбора.Тип,, ПараметрыОтбора.Заголовок));
		
		ЭлементФормы = Элементы.Добавить(КлючИЗначение.Ключ, Тип("ПолеФормы"), Элементы.ГруппаДинамическиеОтборы);
		ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементФормы.КнопкаОчистки = Истина;
		
		ДобавляемыеЭлементы.Добавить(ЭлементФормы);
		
	КонецЦикла;
	
	Если ДобавляемыеРеквизиты.Количество() > 0 Тогда
		ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	КонецЕсли;
	
	Если ДобавляемыеЭлементы.Количество() > 0 Тогда
		Для Каждого ЭлементФормы Из ДобавляемыеЭлементы Цикл
			ЭлементФормы.ПутьКДанным = ЭлементФормы.Имя;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыОтборовУпаковокМДЛП()
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("НомерУпаковки_Отбор"             , Новый Структура("Тип, Заголовок, ИмяМДЛП", Метаданные.ОпределяемыеТипы.НомерУпаковкиМДЛП.Тип, НСтр("ru = 'Номер упаковки'"), "sgtin"));
	ПараметрыОтбора.Вставить("gtin_Отбор"                      , Новый Структура("Тип, Заголовок, ИмяМДЛП", Метаданные.ОпределяемыеТипы.GTIN.Тип, НСтр("ru = 'GTIN'"), "gtin"));
	ПараметрыОтбора.Вставить("НомерГрупповойУпаковкиМДЛП_Отбор", Новый Структура("Тип, Заголовок, ИмяМДЛП", Метаданные.ОпределяемыеТипы.SSCC.Тип, НСтр("ru = 'Номер групповой упаковки'"), "pack3_id"));
	
	Возврат ПараметрыОтбора;
	
КонецФункции

&НаКлиенте
Функция ПолучитьОтборыУпаковокМДЛП()
	
	Отбор = Новый Структура;
	ПараметрыОтборов = ПараметрыОтборовУпаковокМДЛП();
	Для Каждого КлючИЗначение Из ПараметрыОтборов Цикл
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, КлючИЗначение.Ключ) И ЗначениеЗаполнено(ЭтотОбъект[КлючИЗначение.Ключ]) Тогда
			Отбор.Вставить(КлючИЗначение.Значение.ИмяМДЛП, ЭтотОбъект[КлючИЗначение.Ключ]);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Отбор) Тогда
		Возврат Отбор;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОчиститьОтборыУпаковокМДЛП()
	
	ПараметрыОтборов = ПараметрыОтборовУпаковокМДЛП();
	Для Каждого КлючИЗначение Из ПараметрыОтборов Цикл
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, КлючИЗначение.Ключ) Тогда
			ЭтотОбъект[КлючИЗначение.Ключ] = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // Отборы

#Область ЗагрузкаДанныхУпаковок

&НаКлиенте
Процедура НачатьПолучениеУпаковокМДЛП()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПодключения = ТранспортМДЛПАПИВызовСервера.ПараметрыПодключения(Организация, МестоДеятельности);
	
	ПараметрыМетода = Новый Массив;
	ПараметрыМетода.Добавить(ИдентификаторМестаДеятельности);
	ПараметрыМетода.Добавить(ПолучитьОтборыУпаковокМДЛП());
	ПараметрыМетода.Добавить(ИндексПервогоЭлементаПорции(РазмерПорции, ТекущийНомерПорции));
	ПараметрыМетода.Добавить(РазмерПорции);
	
	Оповестить = Новый ОписаниеОповещения("ОбработатьПолучениеПотребительскихУпаковок", ЭтотОбъект);
	ТранспортМДЛПАПИКлиент.ВыполнитьАвторизованныйЗапрос(ПараметрыПодключения, Оповестить, "ПолучитьСписокПотребительскихУпаковокМестаДеятельности", ПараметрыМетода);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолучениеПотребительскихУпаковок(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.ОписаниеОшибки;
	КонецЕсли;
	
	ТранспортныеУпаковки = Новый Массив;
	Для Каждого ЭлементДанныхПотребительскойУпаковки Из Результат.Список Цикл
		НомерГрупповойУпаковкиМДЛП = ЭлементДанныхПотребительскойУпаковки["pack3_id"];
		Если ЗначениеЗаполнено(НомерГрупповойУпаковкиМДЛП) И ТранспортныеУпаковки.Найти(НомерГрупповойУпаковкиМДЛП) = Неопределено Тогда
			ТранспортныеУпаковки.Добавить(НомерГрупповойУпаковкиМДЛП);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыМетода = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТранспортныеУпаковки);
	
	Обработчик = Новый ОписаниеОповещения("ОбработатьПолучениеТранспортныхУпаковок", ЭтотОбъект, Результат);
	ТранспортМДЛПАПИКлиент.ВыполнитьАвторизованныйЗапрос(ПараметрыПодключения, Обработчик, "ПолучитьИерархиюУпаковок", ПараметрыМетода);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеУпаковокМДЛППоНомерамУпаковок(НомераУпаковок)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПодключения = ТранспортМДЛПАПИВызовСервера.ПараметрыПодключения(Организация, МестоДеятельности);
	ПараметрыМетода = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НомераУпаковок);
	
	Обработчик = Новый ОписаниеОповещения("ОбработатьПолучениеПотребительскихУпаковокПоНомерамУпаковок", ЭтотОбъект);
	ТранспортМДЛПАПИКлиент.ВыполнитьАвторизованныйЗапрос(ПараметрыПодключения, Обработчик, "ПолучитьИнформациюОбУпаковках", ПараметрыМетода);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолучениеПотребительскихУпаковокПоНомерамУпаковок(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.ОписаниеОшибки;
	КонецЕсли;
	
	ПотребительскиеУпаковки = Новый Массив;
	ТранспортныеУпаковки = Новый Массив;
	Для Каждого КлючИЗначение Из Результат.Данные.КИЗ Цикл
		
		ПотребительскиеУпаковки.Добавить(КлючИЗначение.Значение);
		
		НомерГрупповойУпаковкиМДЛП = КлючИЗначение.Значение["pack3_id"];
		Если ЗначениеЗаполнено(НомерГрупповойУпаковкиМДЛП) И ТранспортныеУпаковки.Найти(НомерГрупповойУпаковкиМДЛП) = Неопределено Тогда
			ТранспортныеУпаковки.Добавить(НомерГрупповойУпаковкиМДЛП);
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныПотребительскихУпаковок = Новый Структура;
	ДанныПотребительскихУпаковок.Вставить("Список", ПотребительскиеУпаковки);
	ДанныПотребительскихУпаковок.Вставить("Всего" , ПотребительскиеУпаковки.Количество());
	
	ПараметрыМетода = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТранспортныеУпаковки);
	
	Обработчик = Новый ОписаниеОповещения("ОбработатьПолучениеТранспортныхУпаковок", ЭтотОбъект, ДанныПотребительскихУпаковок);
	ТранспортМДЛПАПИКлиент.ВыполнитьАвторизованныйЗапрос(ПараметрыПодключения, Обработчик, "ПолучитьИерархиюУпаковок", ПараметрыМетода);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолучениеТранспортныхУпаковок(Результат, ДанныПотребительскихУпаковок) Экспорт
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.ОписаниеОшибки;
	КонецЕсли;
	
	НомераПорций = ПредставлениеНомеровПорций(ДанныПотребительскихУпаковок.Всего, РазмерПорции, ТекущийНомерПорции, 4);
	
	Объект.ДанныеПотребительскихУпаковок.Очистить();
	ИерархияУпаковок.ПолучитьЭлементы().Очистить();
	
	ЗакончитьПолучениеУпаковокМДЛП(Результат.Данные, ДанныПотребительскихУпаковок.Список);
	
	РазвернутьДеревоРекурсивно(ИерархияУпаковок, Элементы.ИерархияУпаковок);
	
КонецПроцедуры

&НаСервере
Процедура ЗакончитьПолучениеУпаковокМДЛП(Знач ДанныеТранспортныхУпаковок, Знач ДанныПотребительскихУпаковок)
	
	Иерархия = РеквизитФормыВЗначение("ИерархияУпаковок");
	
	ЗаполнитьИерархиюТранспортныхУпаковок(ДанныеТранспортныхУпаковок, Иерархия);
	ЗаполнитьДанныеПотребительскихУпаковок(ДанныПотребительскихУпаковок, Иерархия);
	ДозаполнитьУчетнымиДанными(Иерархия);
	
	УстановитьОтображениеКнопок(Элементы.ЗаполнитьУпаковкиПоДаннымМДЛП.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИерархиюТранспортныхУпаковок(ДанныеТранспортныхУпаковок, Иерархия)
	
	Для Каждого ДанныеУпаковки Из ДанныеТранспортныхУпаковок Цикл
		
		СтрокиИерархии = Иерархия.Строки;
		
		НомерУпаковки = ДанныеУпаковки["sscc"];
		Строка = СтрокиИерархии.Найти(НомерУпаковки, "НомерУпаковки", Истина);
		Если Строка = Неопределено Тогда
			
			ЕстьИнформацияВМДЛП = ДанныеУпаковки["error_code"] = Неопределено;
			Если ЕстьИнформацияВМДЛП Тогда
				
				НомерГрупповойУпаковкиМДЛП = Неопределено;
				ДокументРезерваМДЛП        = Неопределено;
				
				// Добавление групповых упаковок в иерархию.
				// Обратить внимание на то, что массив "up" содержит только один уровень,
				// а иерархия выражена в виде сортировки в массиве,
				// т.е. самая верхняя упаковка - это самый последний элемент массива.
				ВерхняяГраница = ДанныеУпаковки["up"].ВГраница();
				Для Индекс = 0 По ВерхняяГраница Цикл
					
					НомерУпаковкиВерхнегоУровня = ДанныеУпаковки["up"][ВерхняяГраница - Индекс]["sscc"];
					Строка = СтрокиИерархии.Найти(НомерУпаковкиВерхнегоУровня, "НомерУпаковки");
					Если Строка = Неопределено Тогда
						
						Строка = СтрокиИерархии.Добавить();
						Строка.ЕстьИнформацияВМДЛП        = Истина;
						Строка.НомерУпаковки              = НомерУпаковкиВерхнегоУровня;
						Строка.НомерГрупповойУпаковкиМДЛП = НомерГрупповойУпаковкиМДЛП;
						Строка.ДокументРезерваМДЛП        = ДокументРезерваМДЛП;
						
					КонецЕсли;
					СтрокиИерархии = Строка.Строки;
					
					НомерГрупповойУпаковкиМДЛП = НомерУпаковкиВерхнегоУровня;
					Если ДокументРезерваМДЛП = Неопределено Тогда
						ДокументРезерваМДЛП = НомерУпаковкиВерхнегоУровня;
					КонецЕсли;
					
				КонецЦикла;
				
				Строка = СтрокиИерархии.Добавить();
				Строка.ЕстьИнформацияВМДЛП        = Истина;
				Строка.НомерУпаковки              = НомерУпаковки;
				Строка.НомерГрупповойУпаковкиМДЛП = НомерГрупповойУпаковкиМДЛП;
				Строка.ДокументРезерваМДЛП        = ДокументРезерваМДЛП;
				
			Иначе
				
				// Если получили ошибку, значит массив "up" не заполнен, и добавляем только одну строку.
				Строка = СтрокиИерархии.Добавить();
				Строка.ЕстьИнформацияВМДЛП    = Ложь;
				Строка.НомерУпаковки          = НомерУпаковки;
				Строка.СтатусМДЛП             = РассчитатьСтатусМДЛП(ДанныеУпаковки);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПотребительскихУпаковок(ДанныПотребительскихУпаковок, Иерархия)
	
	Для Каждого ЭлементДанных Из ДанныПотребительскихУпаковок Цикл
		
		СтрокаДанныхУпаковок = Объект.ДанныеПотребительскихУпаковок.Добавить();
		СтрокаДанныхУпаковок.ЕстьИнформацияВМДЛП        = Истина;
		СтрокаДанныхУпаковок.НомерУпаковки              = ЭлементДанных["sgtin"];
		СтрокаДанныхУпаковок.GTIN                       = ЭлементДанных["gtin"];
		СтрокаДанныхУпаковок.КодЕСКЛП                   = ЭлементДанных["drug_code"];
		СтрокаДанныхУпаковок.СтатусМДЛП                 = РассчитатьСтатусМДЛП(ЭлементДанных);
		СтрокаДанныхУпаковок.ДатаСтатусаМДЛП            = ТранспортМДЛПАПИКлиентСервер.СтрокаВДату(ЭлементДанных["status_date"]);
		СтрокаДанныхУпаковок.НомерСерии                 = ЭлементДанных["batch"];
		СтрокаДанныхУпаковок.ГоденДо                    = ТранспортМДЛПАПИКлиентСервер.СтрокаВДату(ЭлементДанных["expiration_date"]);
		СтрокаДанныхУпаковок.НаименованиеТовара         = ЭлементДанных["full_prod_name"];
		СтрокаДанныхУпаковок.НомерГрупповойУпаковкиМДЛП = ЭлементДанных["pack3_id"];
		СтрокаДанныхУпаковок.ВладелецМДЛП               = ЭлементДанных["owner"];
		
		ИсточникФинансированияМДЛП = ЭлементДанных["source_type"];
		Если ЗначениеЗаполнено(ИсточникФинансированияМДЛП) Тогда
			СтрокаДанныхУпаковок.ИсточникФинансированияМДЛП = Перечисления.ИсточникиФинансированияМДЛП.Получить(ИсточникФинансированияМДЛП - 1);
		КонецЕсли;
		
		ТипЭмиссииМДЛП = ЭлементДанных["emission_type"];
		Если ЗначениеЗаполнено(ТипЭмиссииМДЛП) Тогда
			СтрокаДанныхУпаковок.ТипЭмиссииМДЛП = Перечисления.ТипыЭмиссииУпаковокМДЛП.Получить(ТипЭмиссииМДЛП - 1);
		КонецЕсли;
		
		Родитель = Иерархия.Строки.Найти(СтрокаДанныхУпаковок.НомерГрупповойУпаковкиМДЛП, "НомерУпаковки", Истина);
		Если ТипЗнч(Родитель) = Тип("СтрокаДереваЗначений") И Родитель.ЕстьИнформацияВМДЛП Тогда
			
			СтрокаДанныхУпаковок.ДокументРезерваМДЛП = Родитель.ДокументРезерваМДЛП;
			Если Не ЗначениеЗаполнено(СтрокаДанныхУпаковок.ДокументРезерваМДЛП) Тогда
				// Родитель сам является упаковкой самого верхнего уровня.
				СтрокаДанныхУпаковок.ДокументРезерваМДЛП = Родитель.НомерУпаковки;
			КонецЕсли;
			
			// Дозаполнение родительских записей.
			Родитель.ВложеныПотребительскиеУпаковкиМДЛП = Истина;
			Пока ТипЗнч(Родитель) = Тип("СтрокаДереваЗначений") Цикл
				Родитель.СтатусМДЛП      = СтрокаДанныхУпаковок.СтатусМДЛП;
				Родитель.ДатаСтатусаМДЛП = СтрокаДанныхУпаковок.ДатаСтатусаМДЛП;
				Родитель = Родитель.Родитель;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДозаполнитьУчетнымиДанными(Иерархия)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ИСТИНА                                       КАК ЕстьИнформацияВБазе,
	|	УпаковкиМДЛП.НомерУпаковки                   КАК НомерУпаковки,
	|	УпаковкиМДЛП.Статус                          КАК Статус,
	|	УпаковкиМДЛП.ИсходныйСтатус                  КАК ИсходныйСтатус,
	|	УпаковкиМДЛП.ДокументРезерва                 КАК ДокументРезерва,
	|	УпаковкиМДЛП.ДатаСтатуса                     КАК ДатаСтатуса,
	|	УпаковкиМДЛП.НомерГрупповойУпаковки          КАК НомерГрупповойУпаковки,
	|	УпаковкиМДЛП.ГрупповаяУпаковка               КАК ГрупповаяУпаковка,
	|	УпаковкиМДЛП.ВложеныПотребительскиеУпаковки  КАК ВложеныПотребительскиеУпаковки,
	|	УпаковкиМДЛП.Владелец                        КАК Владелец
	|ИЗ
	|	РегистрСведений.УпаковкиМДЛП КАК УпаковкиМДЛП
	|ГДЕ
	|	УпаковкиМДЛП.МестоДеятельности = &МестоДеятельности
	|");
	
	Запрос.УстановитьПараметр("МестоДеятельности", МестоДеятельности);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПотребительскихУпаковок = Объект.ДанныеПотребительскихУпаковок.Выгрузить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Строка = ДанныеПотребительскихУпаковок.Найти(Выборка.НомерУпаковки, "НомерУпаковки");
		Если Строка = Неопределено Тогда
			Строка = Иерархия.Строки.Найти(Выборка.НомерУпаковки, "НомерУпаковки", Истина);
			Если Строка = Неопределено Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Строка, Выборка);
		
	КонецЦикла;
	
	Для Каждого Строка Из ДанныеПотребительскихУпаковок Цикл
		
		ПараметрыЗаполнения = ИнтеграцияМДЛПКлиентСервер.ПараметрыЗаполненияТабличнойЧасти();
		ПараметрыЗаполнения.ОбработатьУпаковки = Ложь;
		ПараметрыЗаполнения.ПроверитьСериюРассчитатьСтатус = Истина;
		ПараметрыЗаполнения.ПараметрыУказанияСерий = ПараметрыУказанияСерий;
		
		ИнтеграцияМДЛППереопределяемый.ПриИзмененииПараметровНоменклатуры(ЭтотОбъект, Строка, ПараметрыЗаполнения);
		
	КонецЦикла;
	
	Объект.ДанныеПотребительскихУпаковок.Загрузить(ДанныеПотребительскихУпаковок);
	
	ГосударственныеИнформационныеСистемыПереопределяемый.ЗаполнитьСлужебныеРеквизитыВКоллекции(ЭтотОбъект, Объект.ДанныеПотребительскихУпаковок);
	
	ЗначениеВРеквизитФормы(Иерархия, "ИерархияУпаковок");
	
	ЗаполнитьДанныеТранспортныхУпаковокИзИерархииУпаковок();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеТранспортныхУпаковокИзИерархииУпаковок()
	
	Объект.ДанныеТранспортныхУпаковок.Очистить();
	
	Стек = Новый Массив;
	Стек.Добавить(ИерархияУпаковок.ПолучитьЭлементы());
	
	Пока Стек.Количество() > 0 Цикл
		
		СтрокиИерархии = Стек[0];
		Стек.Удалить(0);
		
		Для Каждого Строка Из СтрокиИерархии Цикл
			
			ПодчененныеСтроки = Строка.ПолучитьЭлементы();
			Если ПодчененныеСтроки.Количество() > 0 Тогда
				Стек.Добавить(ПодчененныеСтроки);
			КонецЕсли;
			
			СтрокаДанныхУпаковок = Объект.ДанныеТранспортныхУпаковок.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДанныхУпаковок, Строка);
			СтрокаДанныхУпаковок.ИдентификаторСтрокиИерархии = Строка.ПолучитьИдентификатор();
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // ЗагрузкаДанныхУпаковок

#Область ЗаполнениеСтрок

&НаСервере
Функция СгенерироватьСерииНаСервере()
	
	Результат = ИнтеграцияМДЛП.ПустойРезультатЗаполненияСерий();
	
	ДанныеПотребительскихУпаковок = Объект.ДанныеПотребительскихУпаковок.Выгрузить();
	
	Если Объект.ДанныеПотребительскихУпаковок.Количество() > 0 Тогда
		ИнтеграцияМДЛППереопределяемый.ЗаполнитьСгенерироватьСерии(Объект, "ДанныеПотребительскихУпаковок",, ПараметрыУказанияСерий, Результат);
	КонецЕсли;
	
	Если Результат.ЕстьЗаполненныеСтроки Тогда
		
		Для Каждого СтрокаДанныхУпаковок Из Объект.ДанныеПотребительскихУпаковок Цикл
			Строка = ДанныеПотребительскихУпаковок.Найти(СтрокаДанныхУпаковок.НомерУпаковки, "НомерУпаковки");
			Если Строка.Серия <> СтрокаДанныхУпаковок.Серия Тогда
				СтрокаДанныхУпаковок.ИзмененыДанныеНоменклатуры = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗаполнитьУпаковкиПоДаннымМДЛПНаСервере()
	
	Результат = ПустойРезультатИзмененияИнформацииОбУпаковках();
	
	СоответствиеСтатусов = СоответствиеСтатусов();
	
	СтатусыУпаковокМДЛП = Новый Структура;
	СтатусыУпаковокМДЛП.Вставить("ВРезерве" , Перечисления.СтатусыУпаковокМДЛП.ВРезерве);
	СтатусыУпаковокМДЛП.Вставить("ВУпаковке", Перечисления.СтатусыУпаковокМДЛП.ВУпаковке);
	
	// Заполнение потребительских упаковок.
	Для Каждого СтрокаДанныхУпаковок Из Объект.ДанныеПотребительскихУпаковок Цикл
		
		Если Не СтрокаДанныхУпаковок.ЕстьИнформацияВМДЛП Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаДанныхУпаковок.ЕстьИнформацияВБазе И СтрокаДанныхУпаковок.Статус = СтатусыУпаковокМДЛП.ВРезерве Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеАктуализации = Новый Структура("Статус, ДатаСтатуса, ДокументРезерва, ГрупповаяУпаковка, НомерГрупповойУпаковки");
		
		Если ЗначениеЗаполнено(СтрокаДанныхУпаковок.НомерГрупповойУпаковкиМДЛП) Тогда
			ДанныеАктуализации.Статус = СтатусыУпаковокМДЛП.ВУпаковке;
		Иначе
			ДанныеАктуализации.Статус = СоответствиеСтатусов[СтрокаДанныхУпаковок.СтатусМДЛП];
		КонецЕсли;
		
		ДанныеАктуализации.ДатаСтатуса            = СтрокаДанныхУпаковок.ДатаСтатусаМДЛП;
		ДанныеАктуализации.ДокументРезерва        = СтрокаДанныхУпаковок.ДокументРезерваМДЛП;
		ДанныеАктуализации.ГрупповаяУпаковка      = Ложь;
		ДанныеАктуализации.НомерГрупповойУпаковки = СтрокаДанныхУпаковок.НомерГрупповойУпаковкиМДЛП;
		
		Для Каждого КлючИЗначение Из ДанныеАктуализации Цикл
			Если СтрокаДанныхУпаковок[КлючИЗначение.Ключ] <> КлючИЗначение.Значение Тогда
				СтрокаДанныхУпаковок[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
				СтрокаДанныхУпаковок.ИзмененаИнформацияОбУпаковках = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если СтрокаДанныхУпаковок.ИзмененаИнформацияОбУпаковках Тогда
			Результат.ЕстьЗаполненныеСтроки = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	// Заполнение транспортных упаковок.
	Для Каждого СтрокаДанныхУпаковок Из Объект.ДанныеТранспортныхУпаковок Цикл
		
		Если Не СтрокаДанныхУпаковок.ЕстьИнформацияВМДЛП Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаДанныхУпаковок.ЕстьИнформацияВБазе И СтрокаДанныхУпаковок.Статус = СтатусыУпаковокМДЛП.ВРезерве Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеАктуализации = Новый Структура("Статус, ДатаСтатуса, ДокументРезерва, ГрупповаяУпаковка, НомерГрупповойУпаковки, ВложеныПотребительскиеУпаковки");
		
		Если ЗначениеЗаполнено(СтрокаДанныхУпаковок.НомерГрупповойУпаковкиМДЛП) Тогда
			ДанныеАктуализации.Статус = СтатусыУпаковокМДЛП.ВУпаковке;
		Иначе
			ДанныеАктуализации.Статус = СоответствиеСтатусов[СтрокаДанныхУпаковок.СтатусМДЛП];
		КонецЕсли;
		
		ДанныеАктуализации.ДатаСтатуса                    = СтрокаДанныхУпаковок.ДатаСтатусаМДЛП;
		ДанныеАктуализации.ДокументРезерва                = СтрокаДанныхУпаковок.ДокументРезерваМДЛП;
		ДанныеАктуализации.ГрупповаяУпаковка              = Истина;
		ДанныеАктуализации.НомерГрупповойУпаковки         = СтрокаДанныхУпаковок.НомерГрупповойУпаковкиМДЛП;
		ДанныеАктуализации.ВложеныПотребительскиеУпаковки = СтрокаДанныхУпаковок.ВложеныПотребительскиеУпаковкиМДЛП;
		
		Для Каждого КлючИЗначение Из ДанныеАктуализации Цикл
			Если СтрокаДанныхУпаковок[КлючИЗначение.Ключ] <> КлючИЗначение.Значение Тогда
				СтрокаДанныхУпаковок[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
				СтрокаДанныхУпаковок.ИзмененаИнформацияОбУпаковках = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если СтрокаДанныхУпаковок.ИзмененаИнформацияОбУпаковках Тогда
			Строка = ИерархияУпаковок.НайтиПоИдентификатору(СтрокаДанныхУпаковок.ИдентификаторСтрокиИерархии);
			ЗаполнитьЗначенияСвойств(Строка, СтрокаДанныхУпаковок);
			Результат.ЕстьЗаполненныеСтроки = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Результат.ЕстьЗаполненныеСтроки Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
	УстановитьОтображениеКнопок(Элементы.ЗаписатьИзмененияУпаковок.Имя);
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПустойРезультатИзмененияИнформацииОбУпаковках()
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьЗаполненныеСтроки", Ложь);
	Результат.Вставить("Ошибки");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОповеститьОбОкончанииЗаполненияУпаковок(Результат)
	
	ОчиститьСообщения();
	
	Если Результат.ЕстьЗаполненныеСтроки Тогда
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Информация об упаковках актуализирована'"),
			,
			НСтр("ru = 'Информация об упаковках актуализирована'"),
			БиблиотекаКартинок.Информация32);
	Иначе
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Информация об упаковках не актуализирована'"),
			,
			НСтр("ru = 'Ни в одной строке информация об упаковках не актуализирована'"),
			БиблиотекаКартинок.Информация32);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Результат.Ошибки);
	
КонецПроцедуры

#КонецОбласти // ЗаполнениеСтрок

#Область ЗаписьУпаковокМДЛП

// Продолжение процедуры ПередЗакрытием
//
&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ЗаписатьНаКлиенте();
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНаКлиенте()
	
	ОчиститьСообщения();
	
	ЗаписатьНаСервере();
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	Если Модифицированность Тогда
		
		ИмяТабличнойЧасти = Метаданные.Обработки.СверкаОстатковМДЛП.ТабличныеЧасти.ДанныеПотребительскихУпаковок.Имя;
		
		СтандартнаяОбработка = Истина;
		СобытияФормМДЛППереопределяемый.ЗаписатьРезультатСверкиОстатков(ЭтотОбъект, Объект, ИмяТабличнойЧасти, СтандартнаяОбработка);
		
		Если СтандартнаяОбработка Тогда
			ЗаписатьУпаковкиМДЛП(Объект[ИмяТабличнойЧасти]);
		КонецЕсли;
		
		ИмяТабличнойЧасти = Метаданные.Обработки.СверкаОстатковМДЛП.ТабличныеЧасти.ДанныеТранспортныхУпаковок.Имя;
		
		СтандартнаяОбработка = Истина;
		СобытияФормМДЛППереопределяемый.ЗаписатьРезультатСверкиОстатков(ЭтотОбъект, Объект, ИмяТабличнойЧасти, СтандартнаяОбработка);
		
		Если СтандартнаяОбработка Тогда
			ЗаписатьУпаковкиМДЛП(Объект[ИмяТабличнойЧасти]);
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьОтображениеКнопок();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьУпаковкиМДЛП(ДанныеУпаковок)
	
	ИзмененияИнформации = ДанныеУпаковок.Выгрузить(Новый Структура("ИзмененаИнформацияОбУпаковках", Истина));
	Если ИзмененияИнформации.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИзмененияИнформации.Колонки.Добавить("КлючУпаковки", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	Для Каждого СтрокаИзменений Из ИзмененияИнформации Цикл
		СтрокаИзменений.КлючУпаковки = ИнтеграцияМДЛПКлиентСервер.ПолучитьКлючУпаковки(СтрокаИзменений.НомерУпаковки);
	КонецЦикла;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ИзмененияИнформации.НомерУпаковки  КАК НомерУпаковки,
	|	ИзмененияИнформации.КлючУпаковки   КАК КлючУпаковки
	|ПОМЕСТИТЬ НомераУпаковок
	|ИЗ
	|	&ИзмененияИнформации КАК ИзмененияИнформации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УпаковкиМДЛП.НомерУпаковки                   КАК НомерУпаковки,
	|	УпаковкиМДЛП.КлючУпаковки                    КАК КлючУпаковки,
	|	УпаковкиМДЛП.МестоДеятельности               КАК МестоДеятельности,
	|	УпаковкиМДЛП.ДокументРезерва                 КАК ДокументРезерва,
	|	УпаковкиМДЛП.Статус                          КАК Статус,
	|	УпаковкиМДЛП.ДатаСтатуса                     КАК ДатаСтатуса,
	|	УпаковкиМДЛП.Владелец                        КАК Владелец,
	|	УпаковкиМДЛП.НомерГрупповойУпаковки          КАК НомерГрупповойУпаковки,
	|	УпаковкиМДЛП.ИсходныйСтатус                  КАК ИсходныйСтатус,
	|	УпаковкиМДЛП.ГрупповаяУпаковка               КАК ГрупповаяУпаковка,
	|	УпаковкиМДЛП.ВложеныПотребительскиеУпаковки  КАК ВложеныПотребительскиеУпаковки,
	|	УпаковкиМДЛП.ПредыдущийСтатус                КАК ПредыдущийСтатус
	|ИЗ
	|	РегистрСведений.УпаковкиМДЛП КАК УпаковкиМДЛП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			НомераУпаковок КАК НомераУпаковок
	|		ПО
	|			УпаковкиМДЛП.НомерУпаковки = НомераУпаковок.НомерУпаковки
	|			И УпаковкиМДЛП.КлючУпаковки = НомераУпаковок.КлючУпаковки
	|ГДЕ
	|	УпаковкиМДЛП.МестоДеятельности = &МестоДеятельности
	|");
	
	Запрос.УстановитьПараметр("МестоДеятельности", МестоДеятельности);
	Запрос.УстановитьПараметр("ИзмененияИнформации", ИзмененияИнформации);
	УпаковкиМДЛП = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаИзменений Из ИзмененияИнформации Цикл
		
		Отбор = Новый Структура("МестоДеятельности, НомерУпаковки, КлючУпаковки", МестоДеятельности);
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаИзменений);
		
		Набор = РегистрыСведений.УпаковкиМДЛП.СоздатьНаборЗаписей();
		Для Каждого КлючИЗначение Из Отбор Цикл
			Набор.Отбор[КлючИЗначение.Ключ].Установить(КлючИЗначение.Значение);
		КонецЦикла;
		
		Запись = Набор.Добавить();
		
		НайденныеУпаковкиМДЛП = УпаковкиМДЛП.НайтиСтроки(Отбор);
		Если НайденныеУпаковкиМДЛП.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(Запись, НайденныеУпаковкиМДЛП[0]);
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Запись, СтрокаИзменений);
		Запись.МестоДеятельности = МестоДеятельности;
		
		Набор.Записать();
		
	КонецЦикла;
	
	Для Каждого ЭлементДанных Из ДанныеУпаковок Цикл
		ЭлементДанных.ИзмененаИнформацияОбУпаковках = Ложь;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // ЗаписьУпаковокМДЛП

#Область Прочее

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ГосударственныеИнформационныеСистемыПереопределяемый.УстановитьУсловноеОформлениеЕдиницИзмерения(ЭтотОбъект,
		Элементы.ДанныеПотребительскихУпаковокЕдиницаИзмерения.Имя, "Объект.ДанныеПотребительскихУпаковок.Упаковка");
	ГосударственныеИнформационныеСистемыПереопределяемый.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтотОбъект,
		Элементы.ДанныеПотребительскихУпаковокХарактеристика.Имя, "Объект.ДанныеПотребительскихУпаковок.ХарактеристикиИспользуются");
	ГосударственныеИнформационныеСистемыПереопределяемый.УстановитьУсловноеОформлениеСерийНоменклатуры(ЭтотОбъект,
		Элементы.ДанныеПотребительскихУпаковокСерия.Имя, "Объект.ДанныеПотребительскихУпаковок.СтатусУказанияСерий", "Объект.ДанныеПотребительскихУпаковок.ТипНоменклатуры");
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ИерархияУпаковокНомерУпаковки.Имя);
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ИерархияУпаковокСтатусМДЛП.Имя);
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ИерархияУпаковокСтатус.Имя);
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ИерархияУпаковокДокументРезерваМДЛП.Имя);
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ИерархияУпаковокДокументРезерва.Имя);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор,
		"Объект.ДанныеПотребительскихУпаковок.НомерГрупповойУпаковкиМДЛП", Новый ПолеКомпоновкиДанных("ИерархияУпаковок.НомерУпаковки"), ВидСравненияКомпоновкиДанных.Равно);
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,, Истина));
	
КонецПроцедуры

&НаСервере
Процедура МестоДеятельностиПриИзмененииНаСервере()
	
	УстановитьИдентификаторМестаДеятельности();
	УстановитьОтображениеКнопок(Элементы.ПолучитьУпаковкиМДЛП.Имя);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьИдентификаторМестаДеятельности()
	
	Если ЗначениеЗаполнено(МестоДеятельности) Тогда
		ИдентификаторМестаДеятельности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(МестоДеятельности, "Идентификатор");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзТСДЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		ОбработатьШтрихкоды(РезультатВыполнения.ТаблицаТоваров);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкодов)
	
	ОчиститьСообщения();
	
	ШтрихкодыПоТипам = ИнтеграцияМДЛПКлиентСервер.РазобратьШтрихкодыПоТипам(ДанныеШтрихкодов);
	
	НомераУпаковок = Новый Массив;
	Для Каждого ДанныеУпаковки Из ШтрихкодыПоТипам.НомераКиЗ Цикл
		НомераУпаковок.Добавить(ДанныеУпаковки.SGTIN);
	КонецЦикла;
	
	НомераГрупповыхУпаковок = Новый Массив;
	Для Каждого ДанныеУпаковки Из ШтрихкодыПоТипам.НомераТранспортныхУпаковок Цикл
		НомераГрупповыхУпаковок.Добавить(ДанныеУпаковки.SSCC);
	КонецЦикла;
	
	ОчиститьОтборыУпаковокМДЛП();
	
	ТекущийНомерПорции = 1;
	
	Если НомераУпаковок.Количество() > 0 Тогда
		
		Если НомераУпаковок.Количество() = 1 Тогда
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, "НомерУпаковки_Отбор") Тогда
				НомерУпаковки_Отбор = НомераУпаковок[0];
			КонецЕсли;
			НачатьПолучениеУпаковокМДЛП();
		Иначе
			НачатьПолучениеУпаковокМДЛППоНомерамУпаковок(НомераУпаковок);
		КонецЕсли;
		
	ИначеЕсли НомераГрупповыхУпаковок.Количество() > 0 Тогда
		
		Если НомераГрупповыхУпаковок.Количество() = 1 Тогда
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, "НомерГрупповойУпаковкиМДЛП_Отбор") Тогда
				НомерГрупповойУпаковкиМДЛП_Отбор = НомераГрупповыхУпаковок[0];
			КонецЕсли;
			НачатьПолучениеУпаковокМДЛП();
		Иначе
			Текст = НСтр("ru = 'Нет данных для обработки. Пакетно могут быть обработаны только потребительские упаковки.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(Текст);
		КонецЕсли;
		
	Иначе
		Текст = НСтр("ru = 'Нет данных для обработки.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(Текст);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеНомеровПорций(КоличествоЭлементов, РазмерПорции, НомерПорции, КоличествоВидимыхПорцийСнизуСверху)
	
	ВсегоПорций = Макс(Окр(КоличествоЭлементов / РазмерПорции + 0.5, 0, РежимОкругления.Окр15как10), 1);
	
	НижнийПредел  = Макс(Мин(НомерПорции + КоличествоВидимыхПорцийСнизуСверху, ВсегоПорций) - КоличествоВидимыхПорцийСнизуСверху * 2, 1);
	ВерхнийПредел = Мин(Макс(НомерПорции - КоличествоВидимыхПорцийСнизуСверху, 1) + КоличествоВидимыхПорцийСнизуСверху * 2, ВсегоПорций);
	
	СписокНомеровПорций = Новый Массив;
	Для Счетчик = 1 По ВсегоПорций Цикл
		
		Если Счетчик >= НижнийПредел И Счетчик <= ВерхнийПредел Тогда
			Шрифт = ?(Счетчик = НомерПорции, Новый Шрифт(, 12, Истина), Неопределено);
			Содержимое = Новый ФорматированнаяСтрока(Строка(Счетчик) + " ", Шрифт,,, Строка(Счетчик));
			Содержимое = Новый ФорматированнаяСтрока(Содержимое, " ");
		ИначеЕсли Счетчик = 1 Тогда
			Содержимое = Новый ФорматированнаяСтрока(НСтр("ru = 'В начало'"),,,, Строка(Счетчик));
			Содержимое = Новый ФорматированнаяСтрока(Содержимое, " ");
		ИначеЕсли Счетчик = ВсегоПорций Тогда
			Содержимое = Новый ФорматированнаяСтрока(НСтр("ru = 'В конец'"),,,, Строка(Счетчик));
		Иначе
			Продолжить;
		КонецЕсли;
		
		СписокНомеровПорций.Добавить(Содержимое);
		
	КонецЦикла;
	
	Возврат Новый ФорматированнаяСтрока(СписокНомеровПорций);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИндексПервогоЭлементаПорции(РазмерПорции, НомерПорции)
	
	Возврат РазмерПорции * (НомерПорции - 1);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьВводДанныхНоменклатуры(РезультатЗакрытия, ВыбраннаяСтрока) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДанныхУпаковок = Объект.ДанныеПотребительскихУпаковок.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Для Каждого КлючИЗначение Из РезультатЗакрытия Цикл
		Если СтрокаДанныхУпаковок[КлючИЗначение.Ключ] <> КлючИЗначение.Значение Тогда
			СтрокаДанныхУпаковок[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
			СтрокаДанныхУпаковок.ИзмененыДанныеНоменклатуры = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокаДанныхУпаковок.ИзмененыДанныеНоменклатуры Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СоответствиеСтатусов()
	
	Связь = Новый Соответствие;
	Связь.Вставить("marked"                               , ПредопределенноеЗначение("Перечисление.СтатусыУпаковокМДЛП.ОжидаетВыпуска"));
	Связь.Вставить("lp_sampled"                           , ПредопределенноеЗначение("Перечисление.СтатусыУпаковокМДЛП.ВыбылаИзОборота"));
	Связь.Вставить("moved_for_disposal"                   , ПредопределенноеЗначение("Перечисление.СтатусыУпаковокМДЛП.ПереданаНаУничтожение"));
	Связь.Вставить("disposed"                             , ПредопределенноеЗначение("Перечисление.СтатусыУпаковокМДЛП.ВыбылаИзОборота"));
	Связь.Вставить("out_of_circulation"                   , ПредопределенноеЗначение("Перечисление.СтатусыУпаковокМДЛП.ВыбылаИзОборота"));
	Связь.Вставить("transfered_to_owner"                  , ПредопределенноеЗначение("Перечисление.СтатусыУпаковокМДЛП.ВРезерве")); // ПредопределенноеЗначение("Перечисление.СтатусыУпаковокМДЛП.ВОбороте"), Владелец
	Связь.Вставить("shipped"                              , Неопределено);
	Связь.Вставить("arrived"                              , Неопределено);
	Связь.Вставить("declared"                             , Неопределено);
	Связь.Вставить("in_circulation"                       , ПредопределенноеЗначение("Перечисление.СтатусыУпаковокМДЛП.ВОбороте"));
	Связь.Вставить("in_realization"                       , ПредопределенноеЗначение("Перечисление.СтатусыУпаковокМДЛП.ВРезерве")); // ПредопределенноеЗначение("Перечисление.СтатусыУпаковокМДЛП.ВОбороте")
	Связь.Вставить("paused_circulation"                   , Неопределено);
	Связь.Вставить("in_sale"                              , ПредопределенноеЗначение("Перечисление.СтатусыУпаковокМДЛП.ВыбылаИзОборота"));
	Связь.Вставить("in_discount_prescription_sale"        , ПредопределенноеЗначение("Перечисление.СтатусыУпаковокМДЛП.ВыбылаИзОборота"));
	Связь.Вставить("in_medical_use"                       , ПредопределенноеЗначение("Перечисление.СтатусыУпаковокМДЛП.ВыбылаИзОборота"));
	Связь.Вставить("relabeled"                            , Неопределено);
	Связь.Вставить("reexported"                           , Неопределено);
	Связь.Вставить("released_contract"                    , ПредопределенноеЗначение("Перечисление.СтатусыУпаковокМДЛП.ОжидаетВыпуска")); // Владелец
	Связь.Вставить("released_foreign"                     , Неопределено);
	Связь.Вставить("moved_to_unregistered"                , ПредопределенноеЗначение("Перечисление.СтатусыУпаковокМДЛП.ПустаяСсылка"));
	Связь.Вставить("expired"                              , ПредопределенноеЗначение("Перечисление.СтатусыУпаковокМДЛП.ВОбороте"));
	Связь.Вставить("change_owner"                         , Неопределено);
	Связь.Вставить("change_owner_state_gov"               , ПредопределенноеЗначение("Перечисление.СтатусыУпаковокМДЛП.ВРезерве")); // ПредопределенноеЗначение("Перечисление.СтатусыУпаковокМДЛП.ВОбороте")
	Связь.Вставить("confirm_return_paused"                , ПредопределенноеЗначение("Перечисление.СтатусыУпаковокМДЛП.ВРезерве")); // ПредопределенноеЗначение("Перечисление.СтатусыУпаковокМДЛП.ВОбороте")
	Связь.Вставить("experiment_outbound"                  , ПредопределенноеЗначение("Перечисление.СтатусыУпаковокМДЛП.ВыбылаИзОборота"));
	Связь.Вставить("in_partial_medical_use"               , ПредопределенноеЗначение("Перечисление.СтатусыУпаковокМДЛП.ВОбороте"));
	Связь.Вставить("in_partial_sale"                      , ПредопределенноеЗначение("Перечисление.СтатусыУпаковокМДЛП.ВОбороте"));
	Связь.Вставить("in_partial_discount_prescription_sale", ПредопределенноеЗначение("Перечисление.СтатусыУпаковокМДЛП.ВОбороте"));
	Связь.Вставить("moved_to_eeu"                         , ПредопределенноеЗначение("Перечисление.СтатусыУпаковокМДЛП.ПустаяСсылка"));
	Связь.Вставить("moved_to_warehouse"                   , ПредопределенноеЗначение("Перечисление.СтатусыУпаковокМДЛП.ВОбороте"));
	Связь.Вставить("emission"                             , Неопределено);
	Связь.Вставить("ofd_retail_error"                     , Неопределено);
	Связь.Вставить("ofd_discount_prescription_error"      , Неопределено);
	Связь.Вставить("transferred_for_release"              , Неопределено);
	Связь.Вставить("waiting_for_release"                  , Неопределено);
	Связь.Вставить("emitted"                              , Неопределено);
	Связь.Вставить("marked_not_paid"                      , Неопределено);
	Связь.Вставить("released_foreign_not_paid"            , Неопределено);
	Связь.Вставить("expired_not_paid"                     , Неопределено);
	Связь.Вставить("emitted_paid"                         , Неопределено);
	
	Возврат Связь;
	
КонецФункции

&НаКлиенте
Процедура РазвернутьДеревоРекурсивно(СтрокаДерева, ЭлементФормы)
	
	КоллекцияЭлементов = СтрокаДерева.ПолучитьЭлементы();
	Для Каждого Элемент Из КоллекцияЭлементов Цикл
		
		Идентификатор = Элемент.ПолучитьИдентификатор();
		ЭлементФормы.Развернуть(Идентификатор);
		РазвернутьДеревоРекурсивно(Элемент, ЭлементФормы);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РассчитатьСтатусМДЛП(Данные)
	
	ЕстьОшибки = Данные["error_code"] <> Неопределено;
	Если ЕстьОшибки Тогда
		Возврат СтрШаблон("(%1) %2", Данные["error_code"], Данные["error_desc"]);
	Иначе
		ЭтоПотребительскаяУпаковка = Данные["sgtin"] <> Неопределено;
		Если ЭтоПотребительскаяУпаковка Тогда
			Возврат Данные["status"];
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УстановитьОтображениеКнопок(ИмяОсновнойКнопки = Неопределено)
	
	Если ИмяОсновнойКнопки = Неопределено Тогда
		
		Элементы.ПолучитьУпаковкиМДЛП.КнопкаПоУмолчанию = Ложь;
		Элементы.ЗаполнитьУпаковкиПоДаннымМДЛП.КнопкаПоУмолчанию = Ложь;
		Элементы.ЗаписатьИзмененияУпаковок.КнопкаПоУмолчанию = Ложь;
		
		Элементы.ЗаполнитьУпаковкиПоДаннымМДЛП.Видимость = Ложь;
		Элементы.ЗаписатьИзмененияУпаковок.Видимость = Ложь;
		
	ИначеЕсли ИмяОсновнойКнопки = Элементы.ПолучитьУпаковкиМДЛП.Имя Тогда
		
		Элементы.ПолучитьУпаковкиМДЛП.КнопкаПоУмолчанию = Истина;
		Элементы.ЗаполнитьУпаковкиПоДаннымМДЛП.КнопкаПоУмолчанию = Ложь;
		Элементы.ЗаписатьИзмененияУпаковок.КнопкаПоУмолчанию = Ложь;
		
		Элементы.ЗаполнитьУпаковкиПоДаннымМДЛП.Видимость = Ложь;
		Элементы.ЗаписатьИзмененияУпаковок.Видимость = Ложь;
		
	ИначеЕсли ИмяОсновнойКнопки = Элементы.ЗаполнитьУпаковкиПоДаннымМДЛП.Имя Тогда
		
		Элементы.ПолучитьУпаковкиМДЛП.КнопкаПоУмолчанию = Ложь;
		Элементы.ЗаполнитьУпаковкиПоДаннымМДЛП.КнопкаПоУмолчанию = Истина;
		Элементы.ЗаписатьИзмененияУпаковок.КнопкаПоУмолчанию = Ложь;
		
		Элементы.ЗаполнитьУпаковкиПоДаннымМДЛП.Видимость = Истина;
		Элементы.ЗаписатьИзмененияУпаковок.Видимость = Ложь;
		
	ИначеЕсли ИмяОсновнойКнопки = Элементы.ЗаписатьИзмененияУпаковок.Имя Тогда
		
		Элементы.ПолучитьУпаковкиМДЛП.КнопкаПоУмолчанию = Ложь;
		Элементы.ЗаполнитьУпаковкиПоДаннымМДЛП.КнопкаПоУмолчанию = Ложь;
		Элементы.ЗаписатьИзмененияУпаковок.КнопкаПоУмолчанию = Истина;
		
		Элементы.ЗаполнитьУпаковкиПоДаннымМДЛП.Видимость = Ложь;
		Элементы.ЗаписатьИзмененияУпаковок.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // Прочее

#КонецОбласти // СлужебныеПроцедурыИФункции
